# pandas Basic Functionality
#basic functionality of DataFrame

In [1]:
data=[["A",40,50,60,30],["B",85,45,79,12],["C",42,15,60,24],
      ["D",25,78,45,62],["E",45,85,24,56],["F",52,48,56,74],
      ["G",56,87,45,58],["H",56,48,89,52],["I",58,45,66,55],
      ["J",56,87,25,45]]

In [2]:
data

[['A', 40, 50, 60, 30],
 ['B', 85, 45, 79, 12],
 ['C', 42, 15, 60, 24],
 ['D', 25, 78, 45, 62],
 ['E', 45, 85, 24, 56],
 ['F', 52, 48, 56, 74],
 ['G', 56, 87, 45, 58],
 ['H', 56, 48, 89, 52],
 ['I', 58, 45, 66, 55],
 ['J', 56, 87, 25, 45]]

In [3]:
import pandas as pd

In [5]:
df1=pd.DataFrame(data=data,columns=["Name","Maths","Physics","Chemistry","English"])

In [6]:
df1

  Name  Maths  Physics  Chemistry  English
0    A     40       50         60       30
1    B     85       45         79       12
2    C     42       15         60       24
3    D     25       78         45       62
4    E     45       85         24       56
5    F     52       48         56       74
6    G     56       87         45       58
7    H     56       48         89       52
8    I     58       45         66       55
9    J     56       87         25       45

In [10]:
#return list of row index and column index
df1.axes

[RangeIndex(start=0, stop=10, step=1),
 Index(['Name', 'Maths', 'Physics', 'Chemistry', 'English'], dtype='object')]

In [12]:
#Transpose of matrix
df1.T

            0   1   2   3   4   5   6   7   8   9
Name        A   B   C   D   E   F   G   H   I   J
Maths      40  85  42  25  45  52  56  56  58  56
Physics    50  45  15  78  85  48  87  48  45  87
Chemistry  60  79  60  45  24  56  45  89  66  25
English    30  12  24  62  56  74  58  52  55  45

In [15]:
#return datatype of each column
df1.dtypes

Name         object
Maths         int64
Physics       int64
Chemistry     int64
English       int64
dtype: object

In [17]:
#Return True or False if dataframe empty
df1.empty

False

In [18]:
#number of dimension of object
df1.ndim

2

In [20]:
#return total no of elements indtaframe
df1.size

50

In [22]:
#return shape of dataframe
df1.shape

(10, 5)

In [40]:
# display column of dataframe
df1.columns

Index(['Name', 'Maths', 'Physics', 'Chemistry', 'English'], dtype='object')

In [24]:
# return actual values from dataframe as as ndarray
df1.values

array([['A', 40, 50, 60, 30],
       ['B', 85, 45, 79, 12],
       ['C', 42, 15, 60, 24],
       ['D', 25, 78, 45, 62],
       ['E', 45, 85, 24, 56],
       ['F', 52, 48, 56, 74],
       ['G', 56, 87, 45, 58],
       ['H', 56, 48, 89, 52],
       ['I', 58, 45, 66, 55],
       ['J', 56, 87, 25, 45]], dtype=object)

In [26]:
# display first few records from dataframe default 5 records
df1.head()

  Name  Maths  Physics  Chemistry  English
0    A     40       50         60       30
1    B     85       45         79       12
2    C     42       15         60       24
3    D     25       78         45       62
4    E     45       85         24       56

In [27]:
# display first n record records from dataframe default 5 records
df1.head(3)

  Name  Maths  Physics  Chemistry  English
0    A     40       50         60       30
1    B     85       45         79       12
2    C     42       15         60       24

In [28]:
# display last few record records from dataframe default 5 records
df1.tail()

  Name  Maths  Physics  Chemistry  English
5    F     52       48         56       74
6    G     56       87         45       58
7    H     56       48         89       52
8    I     58       45         66       55
9    J     56       87         25       45

In [30]:
# display last two record records from dataframe default 5 records
df1.tail(2)

  Name  Maths  Physics  Chemistry  English
8    I     58       45         66       55
9    J     56       87         25       45

In [36]:
df1

  Name  Maths  Physics  Chemistry  English
0    A     40       50         60       30
1    B     85       45         79       12
2    C     42       15         60       24
3    D     25       78         45       62
4    E     45       85         24       56
5    F     52       48         56       74
6    G     56       87         45       58
7    H     56       48         89       52
8    I     58       45         66       55
9    J     56       87         25       45

In [38]:
# no of student having Same marks in Maths 
df1["Maths"].value_counts()

56    3
45    1
42    1
25    1
40    1
85    1
52    1
58    1
Name: Maths, dtype: int64

In [39]:
# no of student having Same marks in Chemistry 
df1["Chemistry"].value_counts()

45    2
60    2
79    1
89    1
24    1
56    1
25    1
66    1
Name: Chemistry, dtype: int64

In [58]:
# addd new colummn as average of all marks for each student
avg=df1["Maths"]+df1["Physics"]+df1["Chemistry"]+df1["English"]
avg_marks=(avg/400)*100
df1["Perc_Marks"]=avg_marks

In [60]:
df1

  Name  Maths  Physics  Chemistry  English  Perc_Marks
0    A     40       50         60       30       45.00
1    B     85       45         79       12       55.25
2    C     42       15         60       24       35.25
3    D     25       78         45       62       52.50
4    E     45       85         24       56       52.50
5    F     52       48         56       74       57.50
6    G     56       87         45       58       61.50
7    H     56       48         89       52       61.25
8    I     58       45         66       55       56.00
9    J     56       87         25       45       53.25

# Pandas Descriptive Statistics

In [61]:
# sum() return sum of the values for represented axis

In [62]:
df1.sum()

Name          ABCDEFGHIJ
Maths                515
Physics              588
Chemistry            549
English              468
Perc_Marks           530
dtype: object

In [64]:
df1["Maths"].sum()

515

In [65]:
df1["English"].sum()

468

In [67]:
df1.sum(axis=0) #default axis sum row wise

Name          ABCDEFGHIJ
Maths                515
Physics              588
Chemistry            549
English              468
Perc_Marks           530
dtype: object

In [68]:
# sum by column axis 1
df1.sum(axis=1)

0    225.00
1    276.25
2    176.25
3    262.50
4    262.50
5    287.50
6    307.50
7    306.25
8    280.00
9    266.25
dtype: float64

In [71]:
# for returning Avg Value use mean() # by default numeric only #default axis 0
df1.mean()

Maths         51.5
Physics       58.8
Chemistry     54.9
English       46.8
Perc_Marks    53.0
dtype: float64

In [72]:
# for returning Avg Value use mean() # by default numeric only #axis 1 Column wise
df1.mean(axis=1)

0    45.00
1    55.25
2    35.25
3    52.50
4    52.50
5    57.50
6    61.50
7    61.25
8    56.00
9    53.25
dtype: float64

In [73]:
df1["Maths"].mean()

51.5

In [74]:
df1.mode()

  Name  Maths  Physics  Chemistry  English  Perc_Marks
0    A   56.0     45.0       45.0       12        52.5
1    B    NaN     48.0       60.0       24         NaN
2    C    NaN     87.0        NaN       30         NaN
3    D    NaN      NaN        NaN       45         NaN
4    E    NaN      NaN        NaN       52         NaN
5    F    NaN      NaN        NaN       55         NaN
6    G    NaN      NaN        NaN       56         NaN
7    H    NaN      NaN        NaN       58         NaN
8    I    NaN      NaN        NaN       62         NaN
9    J    NaN      NaN        NaN       74         NaN

In [75]:
#mode() return value which has higest occurance in maths
df1["Maths"].mode()

0    56
dtype: int64

In [77]:
#mode() return value which has higest occurance in English # all have same occurance
df1["English"].mode()

0    12
1    24
2    30
3    45
4    52
5    55
6    56
7    58
8    62
9    74
dtype: int64

In [83]:
# unique value in dataframe or in datframes columns
df1["Maths"].unique()

array([40, 85, 42, 25, 45, 52, 56, 58], dtype=int64)

In [90]:
# return unique element in dataframe column
df1["English"].unique()

array([30, 12, 24, 62, 56, 74, 58, 52, 55, 45], dtype=int64)

In [91]:
#return total number of  unique marks in maths  
df1["Maths"].nunique()

8

In [93]:
# Standerd Deviation of dataframes numeric value
df1.std()

Maths         15.608046
Physics       24.165172
Chemistry     20.989151
English       19.124156
Perc_Marks     7.847505
dtype: float64

In [95]:
# Standerd Deviation of dataframes numeric value column Maths
df1["Maths"].std()

15.608046357924207

In [97]:
# varienace of data
df1.var()

Maths         243.611111
Physics       583.955556
Chemistry     440.544444
English       365.733333
Perc_Marks     61.583333
dtype: float64

In [98]:
# varienace of data
df1["Maths"].var()

243.61111111111111

In [102]:
#summerizing Data
df1.describe()

           Maths    Physics  Chemistry    English  Perc_Marks
count  10.000000  10.000000  10.000000  10.000000   10.000000
mean   51.500000  58.800000  54.900000  46.800000   53.000000
std    15.608046  24.165172  20.989151  19.124156    7.847505
min    25.000000  15.000000  24.000000  12.000000   35.250000
25%    42.750000  45.750000  45.000000  33.750000   52.500000
50%    54.000000  49.000000  58.000000  53.500000   54.250000
75%    56.000000  83.250000  64.500000  57.500000   57.125000
max    85.000000  87.000000  89.000000  74.000000   61.500000

In [104]:
#corrrelation in between to elemnts
# three values =>1: strongly relation 0: Neutral -1:strongly negative
df1.corr()

               Maths   Physics  Chemistry   English  Perc_Marks
Maths       1.000000 -0.151420   0.410562 -0.404256    0.408896
Physics    -0.151420  1.000000  -0.713319  0.471624    0.504914
Chemistry   0.410562 -0.713319   1.000000 -0.341638    0.115521
English    -0.404256  0.471624  -0.341638  1.000000    0.542870
Perc_Marks  0.408896  0.504914   0.115521  0.542870    1.000000